<?php
/**
 * Created by PhpStorm.
 * User: panhao
 * Date: 2018/3/22
 * Time: 上午10:49
 * @introduce 返回code
 */

/** 公用代码 **/
$commonCode = [
    10 => '参数不能为空',
];

/** api代码 **/
$apiCode = [
    /** api公用 **/
    100 => '系统错误',
    101 => '添加成功',
    102 => '编辑成功',
    103 => '删除成功',
    104 => '获取成功',
    105 => '发送成功',
    106 => '提交成功',

    111 => '添加失败',
    112 => '编辑失败',
    113 => '删除失败',
    114 => '获取失败',
    115 => '发送失败',
    116 => '网络错误',

    /** 用户 **/
    201 => '用户不存在',
    202 => '授权登陆成功',
    203 => '授权登陆失败',
    204 => '信息提交成功',
    205 => '信息提交失败',
    206 => '验证成功',
    207 => '验证码错误',
    208 => '验证码超时',
    209 => '学历提交成功，待审核',
    210 => '学历提交失败',
    211 => '不合法的用户信息',
    212 => '识别失败，请上传清晰的截图',
    213 => '认证失败，请勿重复认证',
    214 => '用户资料信息不完善',
    215 => '用户认证信息不完善',
    216 => '授权信息错误',
    217 => '请勿重复认证',
    218 => '参数错误订单号',
    219 => '订单取消成功',
    220 => '订单取消失败',
    221 => '订单取消失败',
    222 => '参数错误',
    223 => '注册信息已经存在了',

    /** 公共验证 **/
    601 => '手机号格式不对',

    /** 验证必须 **/
    900 => '手机号必须',
    901 => '手机号不能超过11位',
    902 => '微信号必须',
    903 => '姓名必须',
    904 => '姓名长度限制50位',
    905 => '身份证号必须',
    906 => '身份证号格式错误',
    907 => 'code码必须',
    908 => '验证数据必须',
    909 => 'iv数据必须',



    /** 微信支付 **/
    10001 => '请求成功',
    10002 => '请求失败',
    10003 => '订单创建失败',

    10010 => '商品描述不能为空',
    10011 => '用户不能为空',
    10012 => '订单号不能为空',
    10013 => '金额不能为空',
    10014 => '回调不能为空',
    10015 => '订单号不存在',

    /** 解锁  **/
    20001 => '解锁成功',
    20002 => '您已解锁此用户',
    20011 => '解锁失败',
    20012 => '您的解锁机会已经用完,请通过分享获取机会',
    20013 => '您的今日解锁机会已用完，请明天再来解锁',
    20014 => '被解锁次数达上限',
];

/** backend代码 */
$backendCode = [
    /** api公用 **/
    100 => '系统错误',
    101 => '添加成功',
    102 => '编辑成功',
    103 => '删除成功',
    104 => '获取成功',
    105 => '发送成功',
    106 => '提交成功',

    111 => '添加失败',
    112 => '编辑失败',
    113 => '删除失败',
    114 => '获取失败',
    115 => '发送失败',
    116 => '网络错误',

    20001 => '请求参数错误',
    20002 => '退款成功',
    20003 => '退款失败',
    20004 => '登录失效',
    20005 => '登录成功',

];

return $commonCode + $backendCode + $apiCode;