<?php
/**
 * Created by PhpStorm.
 * User: panhao
 * Date: 2018/3/22
 * Time: 下午2:35
 * @introduce
 */
return [
    'range'=> [
        '0'=>'一年级',
        '1'=>'二年级',
        '2'=>'三年级',
        '3'=>'四年级',
        '4'=>'五年级',
        '5'=>'六年级',
        '6'=>'初一',
        '7'=>'初二',
        '8'=>'初三',
        '9'=>'高一',
        '10'=>'高二',
        '11'=>'高三',
    ],
    'subject'=>[
        '0'=>'语文',
        '1'=>'数学',
        '2'=>'英语',
        '3'=>'科学',
        '4'=>'物理',
        '5'=>'化学',
        '6'=>'生物',
        '7'=>'政治',
        '8'=>'历史',
        '9'=>'地理',
        '10'=>'奥数',
    ],
    'tags'=>[
        '0'=>'严格',
        '1'=>'有针对性',
        '2'=>'幽默',
        '3'=>'耐心',
        '4'=>'名校毕业',
        '5'=>'思维严谨',
        '6'=>'讲课认真',
        '7'=>'氛围轻松',
        '8'=>'生动',
        '9'=>'善于沟通',
        '10'=>'思路清晰',
        '11'=>'内容丰富',
        '12'=>'讲解仔细',
        '13'=>'亲切',
        '14'=>'循循善诱',
    ]
];